frankleonrose/framework-cmsis-atmelsam/variants/atmelsam/sam4l8/include/component/spi.h
#define SPI_MR_OFFSET               0x04         /**< \brief (SPI_MR offset) Mode Register */
#define SPI_MR_RESETVALUE           _U(0x00000000); /**< \brief (SPI_MR reset_value) Mode Register */

#define SPI_MR_MSTR_Pos             0            /**< \brief (SPI_MR) Master/Slave Mode */
#define SPI_MR_MSTR                 (_U(0x1) << SPI_MR_MSTR_Pos)
#define   SPI_MR_MSTR_0_Val               _U(0x0)   /**< \brief (SPI_MR) SPI is in Slave mode. */
#define   SPI_MR_MSTR_1_Val               _U(0x1)   /**< \brief (SPI_MR) SPI is in Master mode. */
#define SPI_MR_MSTR_0               (SPI_MR_MSTR_0_Val             << SPI_MR_MSTR_Pos)
#define SPI_MR_MSTR_1               (SPI_MR_MSTR_1_Val             << SPI_MR_MSTR_Pos)
#define SPI_MR_PS_Pos               1            /**< \brief (SPI_MR) Peripheral Select */
#define SPI_MR_PS                   (_U(0x1) << SPI_MR_PS_Pos)
#define   SPI_MR_PS_0_Val                 _U(0x0)   /**< \brief (SPI_MR) Fixed Peripheral Select. */
#define   SPI_MR_PS_1_Val                 _U(0x1)   /**< \brief (SPI_MR) Variable Peripheral Select. */
#define SPI_MR_PS_0                 (SPI_MR_PS_0_Val               << SPI_MR_PS_Pos)
#define SPI_MR_PS_1                 (SPI_MR_PS_1_Val               << SPI_MR_PS_Pos)
#define SPI_MR_PCSDEC_Pos           2            /**< \brief (SPI_MR) Chip Select Decode */
#define SPI_MR_PCSDEC               (_U(0x1) << SPI_MR_PCSDEC_Pos)
#define   SPI_MR_PCSDEC_0_Val             _U(0x0)   /**< \brief (SPI_MR) The chip selects are directly connected to a peripheral device. */
#define   SPI_MR_PCSDEC_1_Val             _U(0x1)   /**< \brief (SPI_MR) The four chip select lines are connected to a 4- to 16-bit decoder.When PCSDEC equals one, up to 15 Chip Select signals can be generated with the four lines using an external 4- to 16-bitdecoder. The Chip Select Registers define the characteristics of the 16 chip selects according to the following rules:CSR0 defines peripheral chip select signals 0 to 3.CSR1 defines peripheral chip select signals 4 to 7.CSR2 defines peripheral chip select signals 8 to 11.CSR3 defines peripheral chip select signals 12 to 15. */
#define SPI_MR_PCSDEC_0             (SPI_MR_PCSDEC_0_Val           << SPI_MR_PCSDEC_Pos)
#define SPI_MR_PCSDEC_1             (SPI_MR_PCSDEC_1_Val           << SPI_MR_PCSDEC_Pos)
#define SPI_MR_MODFDIS_Pos          4            /**< \brief (SPI_MR) Mode Fault Detection */
#define SPI_MR_MODFDIS              (_U(0x1) << SPI_MR_MODFDIS_Pos)
#define   SPI_MR_MODFDIS_0_Val            _U(0x0)   /**< \brief (SPI_MR) Mode fault detection is enabled. */
#define   SPI_MR_MODFDIS_1_Val            _U(0x1)   /**< \brief (SPI_MR) Mode fault detection is disabled. */
#define SPI_MR_MODFDIS_0            (SPI_MR_MODFDIS_0_Val          << SPI_MR_MODFDIS_Pos)
#define SPI_MR_MODFDIS_1            (SPI_MR_MODFDIS_1_Val          << SPI_MR_MODFDIS_Pos)
#define SPI_MR_WDRBT_Pos            5            /**< \brief (SPI_MR) wait data read before transfer */
#define SPI_MR_WDRBT                (_U(0x1) << SPI_MR_WDRBT_Pos)
#define SPI_MR_RXFIFOEN_Pos         6            /**< \brief (SPI_MR) FIFO in Reception Enable */
#define SPI_MR_RXFIFOEN             (_U(0x1) << SPI_MR_RXFIFOEN_Pos)
#define SPI_MR_LLB_Pos              7            /**< \brief (SPI_MR) Local Loopback Enable */
#define SPI_MR_LLB                  (_U(0x1) << SPI_MR_LLB_Pos)
#define   SPI_MR_LLB_0_Val                _U(0x0)   /**< \brief (SPI_MR) Local loopback path disabled. */
#define   SPI_MR_LLB_1_Val                _U(0x1)   /**< \brief (SPI_MR) Local loopback path enabled.LLB controls the local loopback on the data serializer for testing in Master Mode only. */
#define SPI_MR_LLB_0                (SPI_MR_LLB_0_Val              << SPI_MR_LLB_Pos)
#define SPI_MR_LLB_1                (SPI_MR_LLB_1_Val              << SPI_MR_LLB_Pos)
#define SPI_MR_PCS_Pos              16           /**< \brief (SPI_MR) Peripheral Chip Select */
#define SPI_MR_PCS_Msk              (_U(0xF) << SPI_MR_PCS_Pos)
#define SPI_MR_PCS(value)           (SPI_MR_PCS_Msk & ((value) << SPI_MR_PCS_Pos))
#define SPI_MR_DLYBCS_Pos           24           /**< \brief (SPI_MR) Delay Between Chip Selects */
#define SPI_MR_DLYBCS_Msk           (_U(0xFF) << SPI_MR_DLYBCS_Pos)
#define SPI_MR_DLYBCS(value)        (SPI_MR_DLYBCS_Msk & ((value) << SPI_MR_DLYBCS_Pos))
#define SPI_MR_MASK                 _U(0xFF0F00F7) /**< \brief (SPI_MR) MASK Register */

/* -------- SPI_RDR : (SPI Offset: 0x08) (R/  32) Receive Data Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t RD:16;            /*!< bit:  0..15  Receive Data                       */
    uint32_t PCS:4;            /*!< bit: 16..19  Peripheral Chip Select             */
    uint32_t :12;              /*!< bit: 20..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} SPI_RDR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define SPI_RDR_OFFSET              0x08         /**< \brief (SPI_RDR offset) Receive Data Register */
#define SPI_RDR_RESETVALUE          _U(0x00000000); /**< \brief (SPI_RDR reset_value) Receive Data Register */

#define SPI_RDR_RD_Pos              0            /**< \brief (SPI_RDR) Receive Data */
#define SPI_RDR_RD_Msk              (_U(0xFFFF) << SPI_RDR_RD_Pos)
#define SPI_RDR_RD(value)           (SPI_RDR_RD_Msk & ((value) << SPI_RDR_RD_Pos))
#define SPI_RDR_PCS_Pos             16           /**< \brief (SPI_RDR) Peripheral Chip Select */
#define SPI_RDR_PCS_Msk             (_U(0xF) << SPI_RDR_PCS_Pos)
#define SPI_RDR_PCS(value)          (SPI_RDR_PCS_Msk & ((value) << SPI_RDR_PCS_Pos))
#define SPI_RDR_MASK                _U(0x000FFFFF) /**< \brief (SPI_RDR) MASK Register */

/* -------- SPI_TDR : (SPI Offset: 0x0C) ( /W 32) Transmit Data Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t TD:16;            /*!< bit:  0..15  Transmit Data                      */
    uint32_t PCS:4;            /*!< bit: 16..19  Peripheral Chip Select             */
    uint32_t :4;               /*!< bit: 20..23  Reserved                           */
    uint32_t LASTXFER:1;       /*!< bit:     24  Last Transfer                      */
    uint32_t :7;               /*!< bit: 25..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} SPI_TDR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define SPI_TDR_OFFSET              0x0C         /**< \brief (SPI_TDR offset) Transmit Data Register */
#define SPI_TDR_RESETVALUE          _U(0x00000000); /**< \brief (SPI_TDR reset_value) Transmit Data Register */

#define SPI_TDR_TD_Pos              0            /**< \brief (SPI_TDR) Transmit Data */
#define SPI_TDR_TD_Msk              (_U(0xFFFF) << SPI_TDR_TD_Pos)
#define SPI_TDR_TD(value)           (SPI_TDR_TD_Msk & ((value) << SPI_TDR_TD_Pos))
#define SPI_TDR_PCS_Pos             16           /**< \brief (SPI_TDR) Peripheral Chip Select */
#define SPI_TDR_PCS_Msk             (_U(0xF) << SPI_TDR_PCS_Pos)
#define SPI_TDR_PCS(value)          (SPI_TDR_PCS_Msk & ((value) << SPI_TDR_PCS_Pos))
#define SPI_TDR_LASTXFER_Pos        24           /**< \brief (SPI_TDR) Last Transfer */
#define SPI_TDR_LASTXFER            (_U(0x1) << SPI_TDR_LASTXFER_Pos)
#define   SPI_TDR_LASTXFER_0_Val          _U(0x0)   /**< \brief (SPI_TDR) No effect. */
#define   SPI_TDR_LASTXFER_1_Val          _U(0x1)   /**< \brief (SPI_TDR) The current NPCS will be deasserted after the character written in TD has been transferred. When CSAAT is set, thisallows to close the communication with the current serial peripheral by raising the corresponding NPCS line as soon as TDtransfer has completed. */
#define SPI_TDR_LASTXFER_0          (SPI_TDR_LASTXFER_0_Val        << SPI_TDR_LASTXFER_Pos)
#define SPI_TDR_LASTXFER_1          (SPI_TDR_LASTXFER_1_Val        << SPI_TDR_LASTXFER_Pos)
#define SPI_TDR_MASK                _U(0x010FFFFF) /**< \brief (SPI_TDR) MASK Register */

