frankleonrose/framework-cmsis-atmelsam/variants/atmelsam/sam4l8/include/component/spi.h
#define SPI_CSR_CPOL_Pos            0            /**< \brief (SPI_CSR) Clock Polarity */
#define SPI_CSR_CPOL                (_U(0x1) << SPI_CSR_CPOL_Pos)
#define   SPI_CSR_CPOL_0_Val              _U(0x0)   /**< \brief (SPI_CSR) The inactive state value of SPCK is logic level zero. */
#define   SPI_CSR_CPOL_1_Val              _U(0x1)   /**< \brief (SPI_CSR) The inactive state value of SPCK is logic level one.CPOL is used to determine the inactive state value of the serial clock (SPCK). It is used with NCPHA to produce therequired clock/data relationship between master and slave devices. */
#define SPI_CSR_CPOL_0              (SPI_CSR_CPOL_0_Val            << SPI_CSR_CPOL_Pos)
#define SPI_CSR_CPOL_1              (SPI_CSR_CPOL_1_Val            << SPI_CSR_CPOL_Pos)
#define SPI_CSR_NCPHA_Pos           1            /**< \brief (SPI_CSR) Clock Phase */
#define SPI_CSR_NCPHA               (_U(0x1) << SPI_CSR_NCPHA_Pos)
#define   SPI_CSR_NCPHA_0_Val             _U(0x0)   /**< \brief (SPI_CSR) Data is changed on the leading edge of SPCK and captured on the following edge of SPCK. */
#define   SPI_CSR_NCPHA_1_Val             _U(0x1)   /**< \brief (SPI_CSR) Data is captured on the leading edge of SPCK and changed on the following edge of SPCK.NCPHA determines which edge of SPCK causes data to change and which edge causes data to be captured. NCPHA isused with CPOL to produce the required clock/data relationship between master and slave devices. */
#define SPI_CSR_NCPHA_0             (SPI_CSR_NCPHA_0_Val           << SPI_CSR_NCPHA_Pos)
#define SPI_CSR_NCPHA_1             (SPI_CSR_NCPHA_1_Val           << SPI_CSR_NCPHA_Pos)
#define SPI_CSR_CSNAAT_Pos          2            /**< \brief (SPI_CSR) Chip Select Not Active After Transfer */
#define SPI_CSR_CSNAAT              (_U(0x1) << SPI_CSR_CSNAAT_Pos)
#define SPI_CSR_CSAAT_Pos           3            /**< \brief (SPI_CSR) Chip Select Active After Transfer */
#define SPI_CSR_CSAAT               (_U(0x1) << SPI_CSR_CSAAT_Pos)
#define   SPI_CSR_CSAAT_0_Val             _U(0x0)   /**< \brief (SPI_CSR) The Peripheral Chip Select Line rises as soon as the last transfer is achieved. */
#define   SPI_CSR_CSAAT_1_Val             _U(0x1)   /**< \brief (SPI_CSR) The Peripheral Chip Select does not rise after the last transfer is achieved. It remains active until a new transfer isrequested on a different chip select. */
#define SPI_CSR_CSAAT_0             (SPI_CSR_CSAAT_0_Val           << SPI_CSR_CSAAT_Pos)
#define SPI_CSR_CSAAT_1             (SPI_CSR_CSAAT_1_Val           << SPI_CSR_CSAAT_Pos)
#define SPI_CSR_BITS_Pos            4            /**< \brief (SPI_CSR) Bits Per Transfer */
#define SPI_CSR_BITS_Msk            (_U(0xF) << SPI_CSR_BITS_Pos)
#define SPI_CSR_BITS(value)         (SPI_CSR_BITS_Msk & ((value) << SPI_CSR_BITS_Pos))
#define   SPI_CSR_BITS_8_BPT_Val          _U(0x0)   /**< \brief (SPI_CSR) 8 bits per transfer */
#define   SPI_CSR_BITS_9_BPT_Val          _U(0x1)   /**< \brief (SPI_CSR) 9 bits per transfer */
#define   SPI_CSR_BITS_10_BPT_Val         _U(0x2)   /**< \brief (SPI_CSR) 10 bits per transfer */
#define   SPI_CSR_BITS_11_BPT_Val         _U(0x3)   /**< \brief (SPI_CSR) 11 bits per transfer */
#define   SPI_CSR_BITS_12_BPT_Val         _U(0x4)   /**< \brief (SPI_CSR) 12 bits per transfer */
#define   SPI_CSR_BITS_13_BPT_Val         _U(0x5)   /**< \brief (SPI_CSR) 13 bits per transfer */
#define   SPI_CSR_BITS_14_BPT_Val         _U(0x6)   /**< \brief (SPI_CSR) 14 bits per transfer */
#define   SPI_CSR_BITS_15_BPT_Val         _U(0x7)   /**< \brief (SPI_CSR) 15 bits per transfer */
#define   SPI_CSR_BITS_16_BPT_Val         _U(0x8)   /**< \brief (SPI_CSR) 16 bits per transfer */
#define SPI_CSR_BITS_8_BPT          (SPI_CSR_BITS_8_BPT_Val        << SPI_CSR_BITS_Pos)
#define SPI_CSR_BITS_9_BPT          (SPI_CSR_BITS_9_BPT_Val        << SPI_CSR_BITS_Pos)
#define SPI_CSR_BITS_10_BPT         (SPI_CSR_BITS_10_BPT_Val       << SPI_CSR_BITS_Pos)
#define SPI_CSR_BITS_11_BPT         (SPI_CSR_BITS_11_BPT_Val       << SPI_CSR_BITS_Pos)
#define SPI_CSR_BITS_12_BPT         (SPI_CSR_BITS_12_BPT_Val       << SPI_CSR_BITS_Pos)
#define SPI_CSR_BITS_13_BPT         (SPI_CSR_BITS_13_BPT_Val       << SPI_CSR_BITS_Pos)
#define SPI_CSR_BITS_14_BPT         (SPI_CSR_BITS_14_BPT_Val       << SPI_CSR_BITS_Pos)
#define SPI_CSR_BITS_15_BPT         (SPI_CSR_BITS_15_BPT_Val       << SPI_CSR_BITS_Pos)
#define SPI_CSR_BITS_16_BPT         (SPI_CSR_BITS_16_BPT_Val       << SPI_CSR_BITS_Pos)
#define SPI_CSR_SCBR_Pos            8            /**< \brief (SPI_CSR) Serial Clock Baud Rate */
#define SPI_CSR_SCBR_Msk            (_U(0xFF) << SPI_CSR_SCBR_Pos)
#define SPI_CSR_SCBR(value)         (SPI_CSR_SCBR_Msk & ((value) << SPI_CSR_SCBR_Pos))
#define SPI_CSR_DLYBS_Pos           16           /**< \brief (SPI_CSR) Delay Before SPCK */
#define SPI_CSR_DLYBS_Msk           (_U(0xFF) << SPI_CSR_DLYBS_Pos)
#define SPI_CSR_DLYBS(value)        (SPI_CSR_DLYBS_Msk & ((value) << SPI_CSR_DLYBS_Pos))
#define SPI_CSR_DLYBCT_Pos          24           /**< \brief (SPI_CSR) Delay Between Consecutive Transfers */
#define SPI_CSR_DLYBCT_Msk          (_U(0xFF) << SPI_CSR_DLYBCT_Pos)
#define SPI_CSR_DLYBCT(value)       (SPI_CSR_DLYBCT_Msk & ((value) << SPI_CSR_DLYBCT_Pos))
#define SPI_CSR_MASK                _U(0xFFFFFFFF) /**< \brief (SPI_CSR) MASK Register */

/* -------- SPI_WPCR : (SPI Offset: 0xE4) (R/W 32) Write Protection control Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t WPEN:1;           /*!< bit:      0  Write Protection Enable            */
    uint32_t :7;               /*!< bit:  1.. 7  Reserved                           */
    uint32_t WPKEY:24;         /*!< bit:  8..31  Write Protection Key Password      */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} SPI_WPCR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

